In [47]:
import pandas as pd
import numpy as np

In [4]:
data=pd.Series(np.random.randn(9),
              index=[['a','a','a','b','b','c','c','d','d'],
                    [1,2,3,1,3,1,2,2,3]])

In [5]:
data

a  1    1.105841
   2    0.735461
   3    0.601042
b  1   -0.690460
   3   -0.543469
c  1   -0.221801
   2    2.340935
d  2    1.818924
   3   -0.132943
dtype: float64

In [6]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [7]:
data['b']

1   -0.690460
3   -0.543469
dtype: float64

In [8]:
data['b':'c']

b  1   -0.690460
   3   -0.543469
c  1   -0.221801
   2    2.340935
dtype: float64

In [9]:
data.loc[['b','d']]

b  1   -0.690460
   3   -0.543469
d  2    1.818924
   3   -0.132943
dtype: float64

In [10]:
data.loc[:,2]

a    0.735461
c    2.340935
d    1.818924
dtype: float64

In [11]:
data.unstack()

          1         2         3
a  1.105841  0.735461  0.601042
b -0.690460       NaN -0.543469
c -0.221801  2.340935       NaN
d       NaN  1.818924 -0.132943

In [12]:
data.unstack().stack()

a  1    1.105841
   2    0.735461
   3    0.601042
b  1   -0.690460
   3   -0.543469
c  1   -0.221801
   2    2.340935
d  2    1.818924
   3   -0.132943
dtype: float64

In [13]:
frame=pd.DataFrame(np.arange(12).reshape((4,3)),
                  index=[['a','a','b','b'], [1,2,1,2]],
                  columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [14]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [15]:
frame.index.names=['key1','key2']

In [16]:
frame.columns.names=['state','color']

In [17]:
#好看一点点
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [27]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [43]:
#not in book, I don't understand myself...
frame.columns.get_indexer(['Ohio','Ohio','Colorado'])

array([-1, -1, -1], dtype=int64)

In [48]:
mindex = pd.MultiIndex.from_arrays([['Ohio','Ohio','Colorado'],['Green','Red','Green']],
                      names=['state','color'])

In [49]:
mindex

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

In [53]:
frame2=frame.copy()

In [57]:
frame2=frame.swaplevel('key1','key2')

In [63]:
frame2

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [61]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [62]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [64]:
frame.sum(level='key1')

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [65]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [66]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10